"""
基础数据类型和变量
"""
#整数和浮点数
print ('###########')
print(1_000_000, 3.1415926)
print ('###########')

#字符串
print ('###########')
print('I\'m a developer')
print ('###########')
print('Hi\ncome on')
print ('###########')
print('D:\\code\\github\\python-demo\\input_output\\gbk-demo.txt')
print ('###########')
print('列1\t列2\t列3')
print('1000\t2000\t3000')
print ('###########')
print('''2
3
4''')
print ('###########')
print(r'''2
3
4''')
print(r'Hello, "Bart"')
#布尔值
print ('###########')
print(True)
print ('###########')
print(1 > 2)
print ('###########')
print(1 == 1 and 2 == 2)

#空值
print ('###########')
print(None)
print ('###########')


#变量
#变量名必须是大小写英文、数字和_的组合，且不能用数字开头
#类型不固定的语言称之为动态语言，与之对应的是静态语言。静态语言在定义变量时必须指定变量类型，如果赋值的时候类型不匹配，就会报错。
t_001 = True
t_001 = '134'
t_001 = 123213
print('t_001:', t_001)
print ('###########')
t_002 = '123';
t_003 = t_002;
t_002 = '321';
#t_002指向‘321’，t_003指向‘123’
print('t_002:', t_002, ';t_003:', t_003)
print ('###########')

#常量
print ('###########')
#不能变的变量，全部大写的变量名就代表常量
#但事实上PI仍然是一个变量，Python根本没有任何机制保证PI不会被改变，所以，用全部大写的变量名表示常量只是一个习惯上的用法，如果你一定要改变变量PI的值，也没人能拦住你。
PI = 3.14159265359
print ('###########')

